configuration/src/DataProcessors/InfobasesObjectsMapping/InfobasesObjectsMapping.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>InfobasesObjectsMapping</name>
  <attributes>
    <name>DataImportedSuccessfully</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTableName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceTableObjectTypeName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeMessageFileName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTableSearchFields</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTableFields</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>UsedFieldsList</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>TableFieldsList</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceTypeString</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTypeString</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InfobaseNode</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>IsObjectDeletion</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>UnapprovedMappingTable</name>
    <attributes>
      <name>DestinationUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourceUUID</name>
      <type>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>ChartOfCalculationTypesRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DestinationType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AutomaticallyMappedObjectsTable</name>
    <attributes>
      <name>Check</name>
      <comment>Yes-apply matching, No-do not apply matching</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourceUUID</name>
      <type>
        <types>BusinessProcessRef</types>
        <types>DocumentRef</types>
        <types>ChartOfCalculationTypesRef</types>
        <types>TaskRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DestinationType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField3</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField4</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField5</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField3</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField4</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField5</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationPictureIndex</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourcePictureIndex</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SortTable</name>
    <attributes>
      <name>FieldName</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SortDirection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

configuration/src/DataProcessors/InfobasesObjectsMapping/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Maps objects from the current infobase to objects from the source Infobase.
// Generates a mapping table to be displayed to the user.
// Detects the following types of object mapping:
// - objects mapped using references
// - objects mapped using InfobaseObjectsMaps information register data
// - objects mapped using unapproved mapping - mapping items that are not written to the infobase (current changes)
// - unmapped source objects
// - unmapped destination objects (of the current infobase).
//
Procedure MapObjects(Parameters, TempStorageAddress) Export
	
	PutToTempStorage(ObjectMappingResult(Parameters), TempStorageAddress);
	
EndProcedure

// Maps objects automatically using the mapping fields specified by the user (search fields).
// Compares mapping fields using strict equality.
// Generates a table of automatic mapping to be displayed to the user.
//
Procedure ExecuteAutomaticObjectMapping(Parameters, TempStorageAddress) Export
	
	PutToTempStorage(AutomaticObjectMappingResult(Parameters), TempStorageAddress);
	
EndProcedure

#EndRegion

#Region Private
// For internal use.
//
Function ObjectMappingResult(Parameters)
	
	ObjectsMapping = Create();
	DataExchangeServer.ImportObjectContext(Parameters.ObjectContext, ObjectsMapping);
	
	Cancel = False;
	
	// Applying the table of unapproved mapping items to the database.
	If Parameters.FormAttributes.ApplyOnlyUnapprovedRecordsTable Then
		
		ObjectsMapping.ApplyUnapprovedRecordsTable(Cancel);
		
		If Cancel Then
			Raise NStr("en = 'Errors occurred during object mapping.';");
		EndIf;
		
		Return Undefined;
	EndIf;
	
	// Applying automatic object mapping result obtained by the user.
	If Parameters.FormAttributes.ApplyAutomaticMappingResult Then
		
		// Adding rows to the table of unapproved mapping items
		For Each TableRow In Parameters.AutomaticallyMappedObjectsTable Do
			
			FillPropertyValues(ObjectsMapping.UnapprovedMappingTable.Add(), TableRow);
			
		EndDo;
		
	EndIf;
	
	// Applying the table of unapproved mapping items to the database.
	If Parameters.FormAttributes.ApplyUnapprovedRecordsTable Then
		
		ObjectsMapping.ApplyUnapprovedRecordsTable(Cancel);
		
		If Cancel Then
			Raise NStr("en = 'Errors occurred during object mapping.';");
		EndIf;
		
	EndIf;
	
	// 
	ObjectsMapping.MapObjects(Cancel);
	
	If Cancel Then
		Raise NStr("en = 'Errors occurred during object mapping.';");
	EndIf;
	
	Result = New Structure;
	Result.Insert("ObjectCountInSource",       ObjectsMapping.ObjectCountInSource());
	Result.Insert("ObjectCountInDestination",       ObjectsMapping.ObjectCountInDestination());
	Result.Insert("MappedObjectCount",   ObjectsMapping.MappedObjectCount());
	Result.Insert("UnmappedObjectsCount", ObjectsMapping.UnmappedObjectsCount());
	Result.Insert("MappedObjectPercentage",       ObjectsMapping.MappedObjectPercentage());
	Result.Insert("MappingTable",               ObjectsMapping.MappingTable());
	
	Result.Insert("ObjectContext", DataExchangeServer.GetObjectContext(ObjectsMapping));
	
	Return Result;
EndFunction

// For internal use.
//
Function AutomaticObjectMappingResult(Parameters)
	
	ObjectsMapping = Create();
	DataExchangeServer.ImportObjectContext(Parameters.ObjectContext, ObjectsMapping);
	
	// 
	ObjectsMapping.UsedFieldsList.Clear();
	CommonClientServer.SupplementTable(Parameters.FormAttributes.UsedFieldsList, ObjectsMapping.UsedFieldsList);
	
	// 
	ObjectsMapping.TableFieldsList.Clear();
	CommonClientServer.SupplementTable(Parameters.FormAttributes.TableFieldsList, ObjectsMapping.TableFieldsList);
	
	// 
	ObjectsMapping.UnapprovedMappingTable.Load(Parameters.UnapprovedMappingTable);
	
	Cancel = False;
	
	// 
	ObjectsMapping.ExecuteAutomaticObjectMapping(Cancel, Parameters.FormAttributes.MappingFieldsList);
	
	If Cancel Then
		Raise NStr("en = 'Errors occurred during automatic object mapping.';");
	EndIf;
	
	Result = New Structure;
	Result.Insert("EmptyResult", ObjectsMapping.AutomaticallyMappedObjectsTable.Count() = 0);
	Result.Insert("ObjectContext", DataExchangeServer.GetObjectContext(ObjectsMapping));
	
	Return Result;
EndFunction

#EndRegion

#EndIf
